Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_tim.h
#define LL_TIM_TS_TI1F_ED                      TIM_SMCR_TS_2                                                   /*!< TI1 Edge Detector (TI1F_ED) is used as trigger input */
#define LL_TIM_TS_TI1FP1                       (TIM_SMCR_TS_2 | TIM_SMCR_TS_0)                                 /*!< Filtered Timer Input 1 (TI1FP1) is used as trigger input */
#define LL_TIM_TS_TI2FP2                       (TIM_SMCR_TS_2 | TIM_SMCR_TS_1)                                 /*!< Filtered Timer Input 2 (TI12P2) is used as trigger input */
#define LL_TIM_TS_ETRF                         (TIM_SMCR_TS_2 | TIM_SMCR_TS_1 | TIM_SMCR_TS_0)                 /*!< Filtered external Trigger (ETRF) is used as trigger input */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ETR_POLARITY External Trigger Polarity
  * @{
  */
#define LL_TIM_ETR_POLARITY_NONINVERTED        0x00000000U             /*!< ETR is non-inverted, active at high level or rising edge */
#define LL_TIM_ETR_POLARITY_INVERTED           TIM_SMCR_ETP            /*!< ETR is inverted, active at low level or falling edge */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ETR_PRESCALER External Trigger Prescaler
  * @{
  */
#define LL_TIM_ETR_PRESCALER_DIV1              0x00000000U             /*!< ETR prescaler OFF */
#define LL_TIM_ETR_PRESCALER_DIV2              TIM_SMCR_ETPS_0         /*!< ETR frequency is divided by 2 */
#define LL_TIM_ETR_PRESCALER_DIV4              TIM_SMCR_ETPS_1         /*!< ETR frequency is divided by 4 */
#define LL_TIM_ETR_PRESCALER_DIV8              TIM_SMCR_ETPS           /*!< ETR frequency is divided by 8 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_ETR_FILTER External Trigger Filter
  * @{
  */
#define LL_TIM_ETR_FILTER_FDIV1                0x00000000U                                          /*!< No filter, sampling is done at fDTS */
#define LL_TIM_ETR_FILTER_FDIV1_N2             TIM_SMCR_ETF_0                                       /*!< fSAMPLING=fCK_INT, N=2 */
#define LL_TIM_ETR_FILTER_FDIV1_N4             TIM_SMCR_ETF_1                                       /*!< fSAMPLING=fCK_INT, N=4 */
#define LL_TIM_ETR_FILTER_FDIV1_N8             (TIM_SMCR_ETF_1 | TIM_SMCR_ETF_0)                    /*!< fSAMPLING=fCK_INT, N=8 */
#define LL_TIM_ETR_FILTER_FDIV2_N6             TIM_SMCR_ETF_2                                       /*!< fSAMPLING=fDTS/2, N=6 */
#define LL_TIM_ETR_FILTER_FDIV2_N8             (TIM_SMCR_ETF_2 | TIM_SMCR_ETF_0)                    /*!< fSAMPLING=fDTS/2, N=8 */
#define LL_TIM_ETR_FILTER_FDIV4_N6             (TIM_SMCR_ETF_2 | TIM_SMCR_ETF_1)                    /*!< fSAMPLING=fDTS/4, N=6 */
#define LL_TIM_ETR_FILTER_FDIV4_N8             (TIM_SMCR_ETF_2 | TIM_SMCR_ETF_1 | TIM_SMCR_ETF_0)   /*!< fSAMPLING=fDTS/4, N=8 */
#define LL_TIM_ETR_FILTER_FDIV8_N6             TIM_SMCR_ETF_3                                       /*!< fSAMPLING=fDTS/8, N=6 */
#define LL_TIM_ETR_FILTER_FDIV8_N8             (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_0)                    /*!< fSAMPLING=fDTS/16, N=8 */
#define LL_TIM_ETR_FILTER_FDIV16_N5            (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_1)                    /*!< fSAMPLING=fDTS/16, N=5 */
#define LL_TIM_ETR_FILTER_FDIV16_N6            (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_1 | TIM_SMCR_ETF_0)   /*!< fSAMPLING=fDTS/16, N=6 */
#define LL_TIM_ETR_FILTER_FDIV16_N8            (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_2)                    /*!< fSAMPLING=fDTS/16, N=8 */
#define LL_TIM_ETR_FILTER_FDIV32_N5            (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_2 | TIM_SMCR_ETF_0)   /*!< fSAMPLING=fDTS/32, N=5 */
#define LL_TIM_ETR_FILTER_FDIV32_N6            (TIM_SMCR_ETF_3 | TIM_SMCR_ETF_2 | TIM_SMCR_ETF_1)   /*!< fSAMPLING=fDTS/32, N=6 */
#define LL_TIM_ETR_FILTER_FDIV32_N8            TIM_SMCR_ETF                                         /*!< fSAMPLING=fDTS/32, N=8 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM1_ETRSOURCE External Trigger Source TIM1
  * @{
  */
#define LL_TIM_TIM1_ETRSOURCE_GPIO        0x00000000U                                                                      /*!< ETR input is connected to GPIO */
#define LL_TIM_TIM1_ETRSOURCE_COMP1       (                                                            TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP1_OUT */
#define LL_TIM_TIM1_ETRSOURCE_COMP2       (                                        TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to COMP2_OUT */
#define LL_TIM_TIM1_ETRSOURCE_COMP3       (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP3_OUT */
#define LL_TIM_TIM1_ETRSOURCE_COMP4       (                    TIM1_AF1_ETRSEL_2                                        )  /*!< ETR input is connected to COMP4_OUT */
#define LL_TIM_TIM1_ETRSOURCE_ADC1_AWD1   (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0)  /*!< ADC1 analog watchdog 1 */
#define LL_TIM_TIM1_ETRSOURCE_ADC1_AWD2   (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    )  /*!< ADC1 analog watchdog 2 */
#define LL_TIM_TIM1_ETRSOURCE_ADC1_AWD3   (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ADC1 analog watchdog 3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM2_ETRSOURCE External Trigger Source TIM2
  * @{
  */
#define LL_TIM_TIM2_ETRSOURCE_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define LL_TIM_TIM2_ETRSOURCE_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define LL_TIM_TIM2_ETRSOURCE_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define LL_TIM_TIM2_ETRSOURCE_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define LL_TIM_TIM2_ETRSOURCE_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define LL_TIM_TIM2_ETRSOURCE_TIM3_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM3 ETR */
#define LL_TIM_TIM2_ETRSOURCE_TIM4_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM4 ETR */
#define LL_TIM_TIM2_ETRSOURCE_TIM5_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM5 ETR */
#define LL_TIM_TIM2_ETRSOURCE_TIM18_ETR    (TIM1_AF1_ETRSEL_3                                                            ) /*!< ETR input is connected to TIM18_ETR */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_ETRSOURCE External Trigger Source TIM3
  * @{
  */
#define LL_TIM_TIM3_ETRSOURCE_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define LL_TIM_TIM3_ETRSOURCE_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define LL_TIM_TIM3_ETRSOURCE_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define LL_TIM_TIM3_ETRSOURCE_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define LL_TIM_TIM3_ETRSOURCE_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define LL_TIM_TIM3_ETRSOURCE_TIM2_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM2 ETR */
#define LL_TIM_TIM3_ETRSOURCE_TIM4_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM4 ETR */
#define LL_TIM_TIM3_ETRSOURCE_ADC2_AWD1    (TIM1_AF1_ETRSEL_3                                                            ) /*!< ADC2 analog watchdog 1 */
#define LL_TIM_TIM3_ETRSOURCE_ADC2_AWD2    (TIM1_AF1_ETRSEL_3                                         | TIM1_AF1_ETRSEL_0) /*!< ADC2 analog watchdog 2 */
#define LL_TIM_TIM3_ETRSOURCE_ADC2_AWD3    (TIM1_AF1_ETRSEL_3                     | TIM1_AF1_ETRSEL_1                    ) /*!< ADC2 analog watchdog 3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_ETRSOURCE External Trigger Source TIM4
  * @{
  */
#define LL_TIM_TIM4_ETRSOURCE_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define LL_TIM_TIM4_ETRSOURCE_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define LL_TIM_TIM4_ETRSOURCE_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define LL_TIM_TIM4_ETRSOURCE_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define LL_TIM_TIM4_ETRSOURCE_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define LL_TIM_TIM4_ETRSOURCE_TIM3_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM3 ETR */
#define LL_TIM_TIM4_ETRSOURCE_TIM5_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM5 ETR */
#define LL_TIM_TIM4_ETRSOURCE_TIM18_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM18 ETR */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM5_ETRSOURCE External Trigger Source TIM5
  * @{
  */
#define LL_TIM_TIM5_ETRSOURCE_GPIO         0x00000000U                                                                     /*!< ETR input is connected to GPIO */
#define LL_TIM_TIM5_ETRSOURCE_COMP1        (                                                            TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP1_OUT */
#define LL_TIM_TIM5_ETRSOURCE_COMP2        (                                        TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to COMP2_OUT */
#define LL_TIM_TIM5_ETRSOURCE_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to COMP3_OUT */
#define LL_TIM_TIM5_ETRSOURCE_COMP4        (                    TIM1_AF1_ETRSEL_2                                        ) /*!< ETR input is connected to COMP4_OUT */
#define LL_TIM_TIM5_ETRSOURCE_TIM2_ETR     (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM2 ETR */
#define LL_TIM_TIM5_ETRSOURCE_TIM3_ETR     (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    ) /*!< ETR input is connected to TIM3 ETR */
#define LL_TIM_TIM5_ETRSOURCE_TIM18_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0) /*!< ETR input is connected to TIM18 ETR */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_ETRSOURCE External Trigger Source TIM8
  * @{
  */
#define LL_TIM_TIM8_ETRSOURCE_GPIO         0x00000000U                                                                      /*!< ETR input is connected to GPIO */
#define LL_TIM_TIM8_ETRSOURCE_COMP1        (                                                            TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP1_OUT */
#define LL_TIM_TIM8_ETRSOURCE_COMP2        (                                        TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to COMP2_OUT */
#define LL_TIM_TIM8_ETRSOURCE_COMP3        (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP3_OUT */
#define LL_TIM_TIM8_ETRSOURCE_COMP4        (                    TIM1_AF1_ETRSEL_2                                        )  /*!< ETR input is connected to COMP4_OUT */
#define LL_TIM_TIM8_ETRSOURCE_ADC2_AWD1    (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0)  /*!< ADC2 analog watchdog 1 */
#define LL_TIM_TIM8_ETRSOURCE_ADC2_AWD2    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    )  /*!< ADC2 analog watchdog 2 */
#define LL_TIM_TIM8_ETRSOURCE_ADC2_AWD3    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ADC2 analog watchdog 3 */
#define LL_TIM_TIM8_ETRSOURCE_ADC3_AWD1    (TIM1_AF1_ETRSEL_3                                                            )  /*!< ADC3 analog watchdog 1 */
#define LL_TIM_TIM8_ETRSOURCE_ADC3_AWD2    (TIM1_AF1_ETRSEL_3                                         | TIM1_AF1_ETRSEL_0)  /*!< ADC3 analog watchdog 2 */
#define LL_TIM_TIM8_ETRSOURCE_ADC3_AWD3    (TIM1_AF1_ETRSEL_3                     | TIM1_AF1_ETRSEL_1                    )  /*!< ADC3 analog watchdog 3 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM18_ETRSOURCE External Trigger Source TIM18
  * @{
  */
#define LL_TIM_TIM18_ETRSOURCE_GPIO        0x00000000U                                                                      /*!< ETR input is connected to GPIO */
#define LL_TIM_TIM18_ETRSOURCE_COMP1       (                                                            TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP1_OUT */
#define LL_TIM_TIM18_ETRSOURCE_COMP2       (                                        TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to COMP2_OUT */
#define LL_TIM_TIM18_ETRSOURCE_COMP3       (                                        TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to COMP3_OUT */
#define LL_TIM_TIM18_ETRSOURCE_COMP4       (                    TIM1_AF1_ETRSEL_2                                        )  /*!< ETR input is connected to COMP4_OUT */
#define LL_TIM_TIM18_ETRSOURCE_TIM3_ETR    (                    TIM1_AF1_ETRSEL_2                     | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to TIM3 ETR*/
#define LL_TIM_TIM18_ETRSOURCE_TIM4_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1                    )  /*!< ETR input is connected to TIM4 ETR*/
#define LL_TIM_TIM18_ETRSOURCE_TIM5_ETR    (                    TIM1_AF1_ETRSEL_2 | TIM1_AF1_ETRSEL_1 | TIM1_AF1_ETRSEL_0)  /*!< ETR input is connected to TIM5 ETR */
/**
  * @}
  */


