Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_tim.h
/** @defgroup TIM_LL_EC_TIM4_TI1_RMP  TIM4 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM4_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 1 is connected to GPIO */
#define LL_TIM_TIM4_TI1_RMP_COMP1  TIM_TISEL_TI1SEL_0                                /*!< TIM4 input 1 is connected to COMP1_OUT */
#define LL_TIM_TIM4_TI1_RMP_COMP2  TIM_TISEL_TI1SEL_1                                /*!< TIM4 input 1 is connected to COMP2_OUT */
#define LL_TIM_TIM4_TI1_RMP_COMP3  (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)         /*!< TIM4 input 1 is connected to COMP3_OUT */
#define LL_TIM_TIM4_TI1_RMP_COMP4  TIM_TISEL_TI1SEL_2                                /*!< TIM4 input 1 is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI2_RMP  TIM4 Timer Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM4_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 2 is connected to GPIO */
#define LL_TIM_TIM4_TI2_RMP_COMP1  TIM_TISEL_TI2SEL_0                                /*!< TIM4 input 2 is connected to COMP1_OUT */
#define LL_TIM_TIM4_TI2_RMP_COMP2  TIM_TISEL_TI2SEL_1                                /*!< TIM4 input 2 is connected to COMP2_OUT */
#define LL_TIM_TIM4_TI2_RMP_COMP3  (TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0)         /*!< TIM4 input 2 is connected to COMP3_OUT */
#define LL_TIM_TIM4_TI2_RMP_COMP4  TIM_TISEL_TI2SEL_2                                /*!< TIM4 input 2 is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI3_RMP  TIM4 Timer Input Ch3 Remap
  * @{
  */
#define LL_TIM_TIM4_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 3 is connected to GPIO */
#define LL_TIM_TIM4_TI3_RMP_COMP2  TIM_TISEL_TI3SEL_0                                /*!< TIM4 input 3 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI4_RMP  TIM4 Timer Input Ch4 Remap
  * @{
  */
#define LL_TIM_TIM4_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM4 input 4 is connected to GPIO */
#define LL_TIM_TIM4_TI4_RMP_COMP3  TIM_TISEL_TI4SEL_0                                /*!< TIM4 input 4 is connected to COMP3_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM5_TI1_RMP  TIM5 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM5_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM5 input 1 is connected to GPIO */
#define LL_TIM_TIM5_TI1_RMP_LSI    TIM_TISEL_TI1SEL_0                                /*!< TIM5 input 1 is connected to LSI */
#define LL_TIM_TIM5_TI1_RMP_COMP1  TIM_TISEL_TI1SEL_2                                /*!< TIM5 input 1 is connected to COMP1_OUT */
#define LL_TIM_TIM5_TI1_RMP_COMP2  (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)         /*!< TIM5 input 1 is connected to COMP2_OUT */
#define LL_TIM_TIM5_TI1_RMP_COMP3  (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)         /*!< TIM5 input 1 is connected to COMP3_OUT */
#define LL_TIM_TIM5_TI1_RMP_COMP4  (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)   /*!< TIM5 input 1 is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM5_TI2_RMP  TIM5 Timer Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM5_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM5 input 2 is connected to GPIO */
#define LL_TIM_TIM5_TI2_RMP_COMP1  TIM_TISEL_TI2SEL_0                                /*!< TIM5 input 2 is connected to COMP1_OUT */
#define LL_TIM_TIM5_TI2_RMP_COMP2  TIM_TISEL_TI2SEL_1                                /*!< TIM5 input 2 is connected to COMP2_OUT */
#define LL_TIM_TIM5_TI2_RMP_COMP3  (TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0)         /*!< TIM5 input 2 is connected to COMP3_OUT */
#define LL_TIM_TIM5_TI2_RMP_COMP4  TIM_TISEL_TI2SEL_2                                /*!< TIM5 input 2 is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_TI1_RMP  TIM8 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM8_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM8 input 1 is connected to GPIO */
#define LL_TIM_TIM8_TI1_RMP_COMP1  TIM_TISEL_TI1SEL_0                                /*!< TIM8 input 1 is connected to COMP1_OUT */
#define LL_TIM_TIM8_TI1_RMP_COMP2  TIM_TISEL_TI1SEL_1                                /*!< TIM8 input 1 is connected to COMP2_OUT */
#define LL_TIM_TIM8_TI1_RMP_COMP3  (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)         /*!< TIM8 input 1 is connected to COMP3_OUT */
#define LL_TIM_TIM8_TI1_RMP_COMP4  TIM_TISEL_TI1SEL_2                                /*!< TIM8 input 1 is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_TI1_RMP  TIM15 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM15_TI1_RMP_GPIO  0x00000000U                                       /*!< TIM15 input 1 is connected to GPIO */
#define LL_TIM_TIM15_TI1_RMP_COMP1 TIM_TISEL_TI1SEL_1                                /*!< TIM15 input 1 is connected to COMP1_OUT */
#define LL_TIM_TIM15_TI1_RMP_COMP2 (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)         /*!< TIM15 input 1 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_TI2_RMP  TIM15 Timer Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM15_TI2_RMP_GPIO  0x00000000U                                       /*!< TIM15 input 2 is connected to GPIO */
#define LL_TIM_TIM15_TI2_RMP_COMP2 TIM_TISEL_TI2SEL_0                                /*!< TIM15 input 2 is connected to COMP2_OUT */
#define LL_TIM_TIM15_TI2_RMP_COMP3 TIM_TISEL_TI2SEL_1                                /*!< TIM15 input 2 is connected to COMP3_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM16_TI1_RMP  TIM16 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM16_TI1_RMP_GPIO    0x00000000U                                     /*!< TIM16 input 1 is connected to GPIO */
#define LL_TIM_TIM16_TI1_RMP_MCO     TIM_TISEL_TI1SEL_1                              /*!< TIM16 input 1 is connected to MCO */
#define LL_TIM_TIM16_TI1_RMP_HSE_32  (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)       /*!< TIM16 input 1 is connected to HSE/32 */
#define LL_TIM_TIM16_TI1_RMP_LSI     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)       /*!< TIM16 input 1 is connected to LSI */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM17_TI1_RMP  TIM17 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM17_TI1_RMP_GPIO    0x00000000U                                     /*!< TIM17 input 1 is connected to GPIO */
#define LL_TIM_TIM17_TI1_RMP_MCO     TIM_TISEL_TI1SEL_1                              /*!< TIM17 input 1 is connected to MCO */
#define LL_TIM_TIM17_TI1_RMP_HSE_32  (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)       /*!< TIM17 input 1 is connected to HSE/32 */
#define LL_TIM_TIM17_TI1_RMP_LSI     (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)       /*!< TIM17 input 1 is connected to LSI */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM17_TI1_RMP  TIM17 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM18_TI1_RMP_GPIO    0x00000000U                                                    /*!< TIM18 input 1 is connected to GPIO */
#define LL_TIM_TIM18_TI1_RMP_COMP1   (                                          TIM_TISEL_TI1SEL_0) /*!< TIM18 input 1 is connected to COMP1_OUT */
#define LL_TIM_TIM18_TI1_RMP_COMP2   (                     TIM_TISEL_TI1SEL_1                     ) /*!< TIM18 input 1 is connected to COMP2_OUT */
#define LL_TIM_TIM18_TI1_RMP_COMP3   (                     TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM18 input 1 is connected to COMP3_OUT */
#define LL_TIM_TIM18_TI1_RMP_COMP4   (TIM_TISEL_TI1SEL_2                                          ) /*!< TIM18 input 1 is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM18_TI2_RMP  TIM18 Timer Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM18_TI2_RMP_GPIO    0x00000000U                                                    /*!< TIM18 input 2 is connected to GPIO */
#define LL_TIM_TIM18_TI2_RMP_COMP1   (                                          TIM_TISEL_TI2SEL_0) /*!< TIM18 input 2 is connected to COMP1_OUT */
#define LL_TIM_TIM18_TI2_RMP_COMP2   (                     TIM_TISEL_TI2SEL_1                     ) /*!< TIM18 input 2 is connected to COMP2_OUT */
#define LL_TIM_TIM18_TI2_RMP_COMP3   (                     TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0) /*!< TIM18 input 2 is connected to COMP3_OUT */
#define LL_TIM_TIM18_TI2_RMP_COMP4   (TIM_TISEL_TI2SEL_2                                          ) /*!< TIM18 input 2 is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM10_TI1_RMP  TIM10 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM10_TI1_RMP_GPIO     0x00000000U                                                    /*!< TIM10 input 1 is connected to GPIO */
#define LL_TIM_TIM10_TI1_RMP_RTC      (                                          TIM_CCMR3_TI1SEL_0) /*!< TIM10 input 1 is connected to RTC CLOCK */
#define LL_TIM_TIM10_TI1_RMP_HSE_32   (                     TIM_CCMR3_TI1SEL_1                     ) /*!< TIM10 input 1 is connected to HSE/32 */
#define LL_TIM_TIM10_TI1_RMP_MCO      (                     TIM_CCMR3_TI1SEL_1 | TIM_CCMR3_TI1SEL_0) /*!< TIM10 input 1 is connected to MCO */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM11_TI1_RMP  TIM11 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM11_TI1_RMP_GPIO     0x00000000U                                                    /*!< TIM11 input 1 is connected to GPIO */
#define LL_TIM_TIM11_TI1_RMP_RTC      (                                          TIM_CCMR3_TI1SEL_0) /*!< TIM11 input 1 is connected to RTC CLOCK */
#define LL_TIM_TIM11_TI1_RMP_HSE_32   (                     TIM_CCMR3_TI1SEL_1                     ) /*!< TIM11 input 1 is connected to HSE/32 */
#define LL_TIM_TIM11_TI1_RMP_MCO      (                     TIM_CCMR3_TI1SEL_1 | TIM_CCMR3_TI1SEL_0) /*!< TIM11 input 1 is connected to MCO */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM13_TI1_RMP  TIM13 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM13_TI1_RMP_GPIO     0x00000000U                                                    /*!< TIM13 input 1 is connected to GPIO */
#define LL_TIM_TIM13_TI1_RMP_RTC      (                                          TIM_CCMR3_TI1SEL_0) /*!< TIM13 input 1 is connected to RTC CLOCK */
#define LL_TIM_TIM13_TI1_RMP_HSE_32   (                     TIM_CCMR3_TI1SEL_1                     ) /*!< TIM13 input 1 is connected to HSE/32 */
#define LL_TIM_TIM13_TI1_RMP_MCO      (                     TIM_CCMR3_TI1SEL_1 | TIM_CCMR3_TI1SEL_0) /*!< TIM13 input 1 is connected to MCO */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM14_TI1_RMP  TIM14 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM14_TI1_RMP_GPIO     0x00000000U                                                    /*!< TIM14 input 1 is connected to GPIO */
#define LL_TIM_TIM14_TI1_RMP_RTC      (                                          TIM_CCMR3_TI1SEL_0) /*!< TIM14 input 1 is connected to RTC CLOCK */
#define LL_TIM_TIM14_TI1_RMP_HSE_32   (                     TIM_CCMR3_TI1SEL_1                     ) /*!< TIM14 input 1 is connected to HSE/32 */
#define LL_TIM_TIM14_TI1_RMP_MCO      (                     TIM_CCMR3_TI1SEL_1 | TIM_CCMR3_TI1SEL_0) /*!< TIM14 input 1 is connected to MCO */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM19_TI1_RMP  TIM19 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM19_TI1_RMP_GPIO     0x00000000U                                                    /*!< TIM19 input 1 is connected to GPIO */
#define LL_TIM_TIM19_TI1_RMP_RTC      (                                          TIM_CCMR3_TI1SEL_0) /*!< TIM19 input 1 is connected to RTC CLOCK */
#define LL_TIM_TIM19_TI1_RMP_HSE_32   (                     TIM_CCMR3_TI1SEL_1                     ) /*!< TIM19 input 1 is connected to HSE/32 */
#define LL_TIM_TIM19_TI1_RMP_MCO      (                     TIM_CCMR3_TI1SEL_1 | TIM_CCMR3_TI1SEL_0) /*!< TIM19 input 1 is connected to MCO */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCREF_CLR_INT OCREF clear input selection
  * @{
  */
#define LL_TIM_OCREF_CLR_INT_ETR         OCREF_CLEAR_SELECT_Msk                   /*!< OCREF_CLR_INT is connected to ETRF */
#define LL_TIM_OCREF_CLR_INT_COMP1       0x00000000U                              /*!< OCREF clear input is connected to COMP1_OUT */
#define LL_TIM_OCREF_CLR_INT_COMP2       TIM1_AF2_OCRSEL_0                        /*!< OCREF clear input is connected to COMP2_OUT */
#define LL_TIM_OCREF_CLR_INT_COMP3       TIM1_AF2_OCRSEL_1                        /*!< OCREF clear input is connected to COMP3_OUT */
#define LL_TIM_OCREF_CLR_INT_COMP4       (TIM1_AF2_OCRSEL_1 | TIM1_AF2_OCRSEL_0)  /*!< OCREF clear input is connected to COMP4_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_DIR index direction selection
  * @{
  */
#define LL_TIM_INDEX_UP_DOWN     0x00000000U         /*!< Index resets the counter whatever the direction */
#define LL_TIM_INDEX_UP          TIM_ECR_IDIR_0      /*!< Index resets the counter when up-counting only */
#define LL_TIM_INDEX_DOWN        TIM_ECR_IDIR_1      /*!< Index resets the counter when down-counting only */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_POSITION index positioning selection
  * @{
  */
#define LL_TIM_INDEX_POSITION_DOWN_DOWN    0x00000000U                           /*!< Index resets the counter when AB = 00 */
#define LL_TIM_INDEX_POSITION_DOWN_UP      TIM_ECR_IPOS_0                        /*!< Index resets the counter when AB = 01 */
#define LL_TIM_INDEX_POSITION_UP_DOWN      TIM_ECR_IPOS_1                        /*!< Index resets the counter when AB = 10 */
#define LL_TIM_INDEX_POSITION_UP_UP        (TIM_ECR_IPOS_1 | TIM_ECR_IPOS_0)     /*!< Index resets the counter when AB = 11 */
#define LL_TIM_INDEX_POSITION_DOWN         0x00000000U                           /*!< Index resets the counter when clock is 0 */
#define LL_TIM_INDEX_POSITION_UP           TIM_ECR_IPOS_0                        /*!< Index resets the counter when clock is 1 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_FIRST_INDEX first index selection
  * @{
  */
#define LL_TIM_INDEX_ALL           0x00000000U                           /*!< Index is always active */
#define LL_TIM_INDEX_FIRST_ONLY    TIM_ECR_FIDX                          /*!< The first Index only resets the counter */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_PWPRSC Pulse on compare pulse width prescaler
  * @{
  */
#define LL_TIM_PWPRSC_X1     0x00000000U                                              /*!< Pulse on compare pulse width prescaler 1 */
#define LL_TIM_PWPRSC_X2     TIM_ECR_PWPRSC_0                                         /*!< Pulse on compare pulse width prescaler 2 */
#define LL_TIM_PWPRSC_X4     TIM_ECR_PWPRSC_1                                         /*!< Pulse on compare pulse width prescaler 4 */
#define LL_TIM_PWPRSC_X8     (TIM_ECR_PWPRSC_1 | TIM_ECR_PWPRSC_0)                    /*!< Pulse on compare pulse width prescaler 8 */
#define LL_TIM_PWPRSC_X16    TIM_ECR_PWPRSC_2                                         /*!< Pulse on compare pulse width prescaler 16 */
#define LL_TIM_PWPRSC_X32    (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_0)                    /*!< Pulse on compare pulse width prescaler 32 */
#define LL_TIM_PWPRSC_X64    (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_1)                    /*!< Pulse on compare pulse width prescaler 64 */
#define LL_TIM_PWPRSC_X128   (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_1 | TIM_ECR_PWPRSC_0) /*!< Pulse on compare pulse width prescaler 128 */
/**
  * @}
  */

